In [1]:
import pandas as pd
import numpy as np

C:\Users\harsh\Anaconda3\lib\site-packages\pandas\compat\_optional.py:138: UserWarning: Pandas requires version '2.7.0' or newer of 'numexpr' (version '2.6.9' currently installed).
  warnings.warn(msg, UserWarning)

In [2]:
df = pd.read_csv('height2.csv')
df

       name  height
0     mohan     1.2
1     maria     2.3
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1
17    aamir    14.5
18      ken    23.2
19      Liu    40.2

In [10]:
df.shape

(20, 2)

In [3]:
df.height.describe()

count    20.000000
mean      8.390000
std       8.782812
min       1.200000
25%       5.350000
50%       5.700000
75%       6.275000
max      40.200000
Name: height, dtype: float64

In [4]:
Q3 = df.height.quantile(0.75)
Q1 = df.height.quantile(0.25)
IQR = Q3 - Q1

Q1, Q3, IQR

(5.3500000000000005, 6.275, 0.9249999999999998)

In [5]:
upper_limit = Q3 + 1.5*IQR
lower_limit = Q1 - 1.5*IQR

upper_limit, lower_limit

(7.6625, 3.962500000000001)

In [6]:
df[df.height > upper_limit]

     name  height
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

In [7]:
df[df.height < lower_limit]

    name  height
0  mohan     1.2
1  maria     2.3

In [8]:
df2 = df[(df.height > lower_limit) & (df.height < upper_limit)]
df2

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1

In [9]:
df2.shape

(15, 2)

# Example 2

In [13]:
hwdf = pd.read_csv('height_weight.csv')
hwdf

      gender     height      weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [14]:
hwdf.describe()

             height        weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

# outlier detection

In [15]:
ht_Q1 = hwdf.height.quantile(0.25)
ht_Q3 = hwdf.height.quantile(0.75)
ht_IQR = ht_Q3 - ht_Q1

wt_Q1 = hwdf.weight.quantile(0.25)
wt_Q3 = hwdf.weight.quantile(0.75)
wt_IQR = wt_Q3 - wt_Q1

print(ht_Q1, ht_Q3, ht_IQR)
print(wt_Q1, wt_Q3, wt_IQR)

63.505620481218955 69.1742617268347 5.668641245615746
135.8180513055015 187.16952486868348 51.35147356318197

In [17]:
ht_ll = ht_Q1 - 1.5*ht_IQR
ht_ul = ht_Q3 + 1.5*ht_IQR

wt_ll = wt_Q1 - 1.5*wt_IQR
wt_ul = wt_Q3 + 1.5*wt_IQR

print(ht_ll, ht_ul)
print(wt_ll, wt_ul)

55.00265861279534 77.67722359525831
58.79084096072856 264.19673521345646

In [18]:
hwdf[(hwdf.height > ht_ul)|(hwdf.height < ht_ll)|(hwdf.weight > wt_ul)|(hwdf.weight < wt_ll)]

      gender     height      weight
994     Male  78.095867  255.690835
1317    Male  78.462053  227.342565
2014    Male  78.998742  269.989699
3285    Male  78.528210  253.889004
3757    Male  78.621374  245.733783
6624  Female  54.616858   71.393749
7294  Female  54.873728   78.606670
9285  Female  54.263133   64.700127

In [20]:
hwdf2 = hwdf[(hwdf.height < ht_ul)&(hwdf.height > ht_ll)&(hwdf.weight < wt_ul)&(hwdf.weight > wt_ll)]
hwdf2.shape

(9992, 3)